# Cross-platform Homebrew packages — work on both macOS and Linuxbrew.
# Bundled on every platform. macOS-only formulae, casks and MAS apps live in
# Brewfile.darwin.

# CLI utilities
brew 'atuin'            # shell history on steroids
brew 'bat'              # like 'cat', with highlighting, git support and pagination
brew 'curl'
brew 'direnv'           # Load/unload environment variables based on $PWD
brew 'docker-compose'   # Docker without the hassle
brew 'entr'             # Run arbitrary commands when files change
brew 'erdtree'          # like `tree` but with nicer options
brew 'eza'              # like `ls`
brew 'fd'               # a nicer 'find'
brew 'fzf'              # Fuzzy search
brew 'gawk'             # Like awk, but with a g. Not to be confused with the large bird of prey
brew 'git-delta'        # Provides much better diffs highlighting in the terminal
brew 'graphviz'         # graph/diagrams generation
brew 'htop'
brew 'httpie'           # to test HTTP calls from the CLI
brew 'hyperfine'        # a CLI benchmarking tool, to compare the performance of different commands
brew 'jc'               # To convert the output of commands to json, pairs nicely with jq
brew 'jq'               # When you want to manipulate JSON piped from httpie
brew 'organize-tool'    # file management automation tool
brew 'ouch'             # easily compress/decompress files and directories
brew 'ripgrep'          # like grep, but faster
brew 'rm-improved'      # a better rm, with trash support
brew 'starship'         # a minimalist CLI prompt
brew 'telnet'
brew 'tldr'             # like 'man' but for lazy people with deadlines
brew 'tmux'
brew 'tmuxinator'
brew 'tokei'            # to quickly count lines of code, like cloc, but faster
brew 'tree'             # to display directories tree
brew 'yt-dlp'           # when you want to archive a video locally
brew 'wget'
brew 'wrk'              # a HTTP benchmarking tool, like ab, but better
brew 'zoxide'           # a faster way to navigate your filesystem

# Development
brew 'bfg'              # for that time the intern added passwords to the repo
brew 'exercism'         # to submit code solutions to Exercism.io
brew 'gh'               # GitHub on the CLI
brew 'git'              # OSX's version is out of date
brew 'git-lfs'          # git's large file system
brew 'git-who'          # git blame for file trees
brew 'lazygit'          # terminal UI for git
brew 'neovim'           # the editor
brew 'tree-sitter-cli'  # CLI used by nvim-treesitter (main) to build parsers

# Tools for work
# brew 'assume-role'
# brew 'awscli'
# brew 'gettext'      # to compile messages, don't forget to link!
# brew 'libjpeg'
# brew 'libmagic'
# brew 'libmaxminddb' # for GeoIP
# brew 'libpng'
# brew 'libpq', link: true
# brew 'node'
# brew 'python'
# brew 'pipenv'
# brew 'pyenv'

# Pentesting / CTF / Forensics
brew 'binwalk'          # search for files hidden via steganography
brew 'exiftool'         # reading and writing EXIF metadata
brew 'exiv2'            # EXIF and IPTC metadata
brew 'ffmpeg'
brew 'foremost'         # file recovery based on headers/footer (forensics)
brew 'hashcat'          # GPU password cracking
brew 'john-jumbo'       # John the ripper
brew 'gdb'              # the basic Binjitsu weapon
brew 'pngcheck'
brew 'sqlmap'           # SQL injection
brew 'zbar'             # barcode /qrcode reading
