# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'       # for Fira Code
tap 'homebrew/cask-versions'    # for alternate versions of Casks
tap 'homebrew/php'

# Install Binaries
brew 'cloc'             # to quickly count lines of code
brew 'coreutils'        # Those that come with macOS are outdated
brew 'docker-compose'   # Docker without the hassle
brew 'graphviz'         # graph/diagrams generation
brew 'httpie'           # to test HTTP calls from the CLI
brew 'mackup'           # to sync my Mac configs
brew 'mas'              # to install Mac App Store apps from the CLI
brew 'tldr'             # like 'man' but for lazy people with deadlines
brew 'tree'             # to display directories tree
brew 'wget'
brew 'zsh'              # has to be installed before installing Oh My Zsh
brew 'zsh-completions'  # more auto-completions for Zsh

# Development
brew 'exercism'         # to submit code solutions to Exercism.io
brew 'git'              # OSX's version is out of date
brew 'node'
brew 'php72'            # for Laravel/Symfony dev
brew 'python@2'         # for Django dev

# Pentesting / CTF / Forensics
brew 'binwalk'          # search for files hidden via steganography
brew 'exiftool'         # reading and writing EXIF metadata
brew 'exiv2'            # EXIF and IPTC metadata
brew 'foremost'         # file recovery based on headers/footer (forensics)
brew 'hashcat'          # GPU password cracking
brew 'john-jumbo'       # John the ripper
brew 'sqlmap'           # SQL injection
brew 'wpscan'           # WordPress vulnerability scanner
brew 'zbar'             # barcode /qrcode reading

# Apps
cask 'caffeine'         # when I don't want my computer to fall asleep
cask 'deckset'          # slide decks for conference talks
cask 'docker'
cask 'google-chrome'
cask 'imagealpha'       # optimize transparent PNGs
cask 'imageoptim'       # optimize images
cask 'iterm2'           # a better terminal
cask 'ksdiff'           # CLI launcher for my difftool (Kaleidoscope)
cask 'phpstorm'
cask 'pycharm-ce'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'        # no better ways to move windows around
cask 'sublime-text'
cask 'the-unarchiver'

# Quicklook
cask 'betterzip'        # preview zip archives
cask 'epubquicklook'    # preview zip archives
cask 'qlcolorcode'      # preview source code files with syntax highlighting
cask 'qlimagesize'      # display image size and resolution
cask 'qlmarkdown'       # preview Markdown files
cask 'qlprettypatch'    # preview diff patches
cask 'quicklook-json'   # preview JSON files
cask 'quicklook-csv'    # preview CSV files
cask 'qlstephen'        # preview plain text files without or with unknown file extension
cask 'webpquicklook'    # preview Webp images

# Fonts
cask 'font-fira-code'

# Install Mac App Store apps
mas '1Password', id: 1333542190     # password manager
mas 'Bear', id: 1091189122          # note taking app
mas 'Deliveries', id: 924726344     # package tracking
mas 'Kaleidoscope', id: 587512244   # the best difftool ever, fight me
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334         # nope, RSS is not dead
mas 'Soulver', id: 413965349
mas 'Tweetbot', id: 557168941       # less and less powerful Twitter client (not their fault though!)
