# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'       # for Fira Code and a patched font for vim/neovim
tap 'homebrew/cask-versions'    # for alternate versions of Casks
tap 'eddieantonio/eddieantonio' # for imgcat
tap 'remind101/formulae'        # for assume-role
tap 'homebrew/cask-drivers'     # to flash my Moonlander keyboard firmware

# Install Binaries
brew 'bat'              # like 'cat', with highlighting, git support and pagination
brew 'cloc'             # to quickly count lines of code
brew 'coreutils'        # Those that come with macOS are outdated
brew 'curl'
brew 'docker-compose'   # Docker without the hassle
brew 'gawk'             # Like awk, but with a g. Not to be confused with the large bird of prey
brew 'gnu-sed'          # sed, but a better version than what ships with OSX
brew 'graphviz'         # graph/diagrams generation
brew 'htop'
brew 'httpie'           # to test HTTP calls from the CLI
brew 'imgcat'           # like 'cat', but for images
brew 'mackup'           # to sync my Mac configs
brew 'mas'              # to install Mac App Store apps from the CLI
brew 'neofetch'
brew 'neovim'
brew 'ripgrep'
brew 'telnet'
brew 'tldr'             # like 'man' but for lazy people with deadlines
brew 'tmux'
brew 'tree'             # to display directories tree
brew 'wget'
brew 'zsh'              # has to be installed before installing Oh My Zsh
brew 'zsh-completions'  # more auto-completions for Zsh

# Development
brew 'bfg'              # for that time the intern added passwords to the repo
brew 'exercism'         # to submit code solutions to Exercism.io
brew 'git'              # OSX's version is out of date
brew 'git-lfs'          # git's large file system

# Tools for work
brew 'assume-role'
brew 'awscli'
brew 'gettext'      # to compile messages, don't forget to link!
brew 'jq'
brew 'libjpeg'
brew 'libmagic'
brew 'libmaxminddb' # for GeoIP
brew 'libpng'
brew 'libpq', link: true
brew 'node@14'
brew 'python'
brew 'pipenv'
brew 'pyenv'

# Pentesting / CTF / Forensics
brew 'binwalk'          # search for files hidden via steganography
brew 'exiftool'         # reading and writing EXIF metadata
brew 'exiv2'            # EXIF and IPTC metadata
brew 'ffmpeg'
brew 'foremost'         # file recovery based on headers/footer (forensics)
brew 'hashcat'          # GPU password cracking
brew 'john-jumbo'       # John the ripper
brew 'gdb'              # the basic Binjitsu weapon
brew 'pngcheck'
brew 'sqlmap'           # SQL injection
brew 'wpscan'           # WordPress vulnerability scanner
brew 'zbar'             # barcode /qrcode reading
cask 'hex-fiend'        # a simple GUI hex editor

# Apps
cask 'alfred'
cask 'anki'             # flash cards, for learning and memorization (active recall, spaced repetition, etc)
cask 'caffeine'         # when I don't want my computer to fall asleep
cask 'dash'             # offline docs and code snippets FTW!
cask 'deckset'          # slide decks for conference talks
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'grammarly'
cask 'hiddenbar'        # keep my statusbar tidy
cask 'imagealpha'       # optimize transparent PNGs
cask 'imageoptim'       # optimize images
cask 'insomnia'         # a nice API client GUI
cask 'intellij-idea'
cask 'iterm2'           # a better terminal
cask 'keybase'
cask 'keycastr'         # when pairing remotly, to show all keypresses in vim/neovim
cask 'kitty'
cask 'ksdiff'           # CLI launcher for my difftool (Kaleidoscope)
cask 'ngrok'
cask 'slack'
cask 'spectacle'        # no better ways to move windows around
cask 'sublime-text'
cask 'zoom'
cask 'zsa-wally'        # to flash my Moonlander keyboard firmware

# Gaming
cask 'battle-net'
cask 'discord'

# Quicklook
cask 'betterzip'        # preview zip archives
cask 'epubquicklook'    # preview zip archives
cask 'qlcolorcode'      # preview source code files with syntax highlighting
cask 'qlimagesize'      # display image size and resolution
cask 'qlmarkdown'       # preview Markdown files
cask 'qlprettypatch'    # preview diff patches
cask 'quicklook-json'   # preview JSON files
cask 'quicklook-csv'    # preview CSV files
cask 'qlstephen'        # preview plain text files without or with unknown file extension
cask 'webpquicklook'    # preview Webp images

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'    # This font adds support for nice icons in NerdTree/NVIMTREE

# Install Mac App Store apps
mas '1Password', id: 1333542190     # password manager
mas 'Bear', id: 1091189122          # note taking app
mas 'Deliveries', id: 290986013     # package tracking
mas 'Grammarly for Safari', id: 1462114288
mas 'Kaleidoscope', id: 587512244   # the best difftool ever, fight me
mas 'Next Meeting', id: 1017470484  # See what meeting is up next, right in the status bar
mas 'Pastebot', id: 1179623856
mas 'Pixelmator', id: 407963104
# mas 'Reeder', id: 880001334         # nope, RSS is not dead
# mas 'Soulver', id: 413965349
mas 'stts', id: 1187772509          # status of cloud services, right in the status bar
# mas 'Tweetbot', id: 557168941       # less and less powerful Twitter client (not their fault though!)
mas 'Vimari', id: 1480933944        # vim bindings for Safari
