# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'       # for Fira Code
tap 'homebrew/cask-versions'    # for alternate versions of Casks
tap 'eddieantonio/eddieantonio' # for imgcat

# Install Binaries
brew 'bat'              # like 'cat', with highlighting, git support and pagination
brew 'cloc'             # to quickly count lines of code
brew 'coreutils'        # Those that come with macOS are outdated
brew 'curl'
brew 'docker-compose'   # Docker without the hassle
brew 'gnu-sed'          # sed, but a better version than what ships with OSX
brew 'graphviz'         # graph/diagrams generation
brew 'httpie'           # to test HTTP calls from the CLI
brew 'imgcat'           # like 'cat', but for images
brew 'mackup'           # to sync my Mac configs
brew 'mas'              # to install Mac App Store apps from the CLI
brew 'telnet'
brew 'tldr'             # like 'man' but for lazy people with deadlines
brew 'tree'             # to display directories tree
brew 'wget'
brew 'zsh'              # has to be installed before installing Oh My Zsh
brew 'zsh-completions'  # more auto-completions for Zsh

# Development
brew 'bfg'              # for that time the intern added passwords to the repo
brew 'exercism'         # to submit code solutions to Exercism.io
brew 'git'              # OSX's version is out of date
brew 'git-lfs'          # git's large file system
brew 'node'

brew 'awscli'
brew 'jq'
brew 'python'
brew 'postgresql@9.6', restart_service: true, link: true
brew 'redis'
brew 'libjpeg'
brew 'libpng'
brew 'libmagic'
cask 'java8'        # required to install elasticsearch
brew 'elasticsearch'
brew 'redis'
brew 'memcached'
brew 'gettext'      # to compile messages, don't forget to link!
brew 'libmaxminddb' # for GeoIP

# Pentesting / CTF / Forensics
brew 'binwalk'          # search for files hidden via steganography
brew 'exiftool'         # reading and writing EXIF metadata
brew 'exiv2'            # EXIF and IPTC metadata
brew 'ffmpeg'
brew 'foremost'         # file recovery based on headers/footer (forensics)
brew 'hashcat'          # GPU password cracking
brew 'john-jumbo'       # John the ripper
brew 'gdb'              # the basic Binjitsu weapon
brew 'pngcheck'
brew 'sqlmap'           # SQL injection
brew 'wpscan'           # WordPress vulnerability scanner
brew 'zbar'             # barcode /qrcode reading
cask 'audacity'
cask 'hex-fiend'        # a simple GUI hex editor
cask 'sonic-visualizer'

# Apps
cask 'caffeine'         # when I don't want my computer to fall asleep
cask 'dash'             # offline docs and code snippets FTW!
cask 'deckset'          # slide decks for conference talks
cask 'docker'
cask 'google-chrome'
cask 'imagealpha'       # optimize transparent PNGs
cask 'imageoptim'       # optimize images
cask 'iterm2'           # a better terminal
cask 'ksdiff'           # CLI launcher for my difftool (Kaleidoscope)
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'        # no better ways to move windows around
cask 'sublime-text'
cask 'the-unarchiver'
cask 'intellij-idea'
cask 'gpg-suite'
cask 'keybase'
cask 'paw'

# Quicklook
cask 'betterzip'        # preview zip archives
cask 'epubquicklook'    # preview zip archives
cask 'qlcolorcode'      # preview source code files with syntax highlighting
cask 'qlimagesize'      # display image size and resolution
cask 'qlmarkdown'       # preview Markdown files
cask 'qlprettypatch'    # preview diff patches
cask 'quicklook-json'   # preview JSON files
cask 'quicklook-csv'    # preview CSV files
cask 'qlstephen'        # preview plain text files without or with unknown file extension
cask 'webpquicklook'    # preview Webp images

# Fonts
cask 'font-fira-code'

# Install Mac App Store apps
mas '1Password', id: 1333542190     # password manager
mas 'Annotate', id: 918207447       # annotate screenshots like a boss
mas 'Bear', id: 1091189122          # note taking app
mas 'Deliveries', id: 924726344     # package tracking
mas 'Kaleidoscope', id: 587512244   # the best difftool ever, fight me
mas 'Pastebot', id: 1179623856
mas 'Pixelmator', id: 407963104
mas 'Reeder', id: 880001334         # nope, RSS is not dead
mas 'Soulver', id: 413965349
mas 'Tweetbot', id: 557168941       # less and less powerful Twitter client (not their fault though!)
